/*************************************************************************************************/
/*----------------------------------  文件名 ： LCD.h  --------------------------------------*/
/*-----------------------------  功能 ： LCD.c对应头文件 -----------------------------------*/
/*************************************************************************************************/
 /*--------------------------------  以下内部文件调用 -----------------------------------*/
#ifndef _H_LCD_
	
	#define _H_LCD_
/*--------------------------------  以下宏定义 -----------------------------------*/

/*--------------------------------  以下内部文件调用 -----------------------------------*/

void write_com(unsigned char com);
void write_data(unsigned char dat);
void LCD_number(unsigned int lcd1);


/*--------------------------------  以下外部文件调用 -----------------------------------*/
void LCD_reset(void);
void LCD_init(void);
void LCD_running(int shuliang,int lucheng,int shijian,int sudu); 
void LCD_stop(int lucheng,int shijian,int diyi,int dier,int disan,int disi);


#endif